#### RebarHostCategory Enumeration

---

|  |
| --- |
| See Also |

Rebar host category

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum RebarHostCategory ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarHostCategory ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarHostCategory ``` |

# Members

| Member name | Description |
| --- | --- |
| Other | Unknown or invalid host. |
| Part | Part. |
| StructuralColumn | Structural Column. |
| StructuralFraming | Structural Framing. |
| Wall | Wall. |
| Floor | Floor. |
| StructuralFoundation | Structural Foundation. |
| Stairs | Stairs. |
| SlabEdge | Slab Edge. |

# See Also

Autodesk.Revit.DB.Structure Namespace